app_server/app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT * FROM "games"

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM "games" WHERE ("games"."id" = 1)