app_server/app/controllers/seats_controller.rb

  def index
    @seats = Seat.all
---
SELECT * FROM "seats"

  def show
    @seat = Seat.find(params[:id])
---
SELECT * FROM "seats" WHERE ("seats"."id" = 3)

  def create
    @seat = Seat.new(params[:seat])
    if @seat.save
---
INSERT INTO "seats" ("created_at", "updated_at", "user_id", "game_id") VALUES('2010-08-01 05:21:38', '2010-08-01 05:21:38', NULL, NULL)

  def destroy
    @seat = Seat.find(params[:id])
    @seat.destroy
---
SELECT * FROM "seats" WHERE ("seats"."id" = 1)
DELETE FROM "seats" WHERE "id" = 1